export const Offer = () => {
  return (
    <div className="px-4 pb-4 relative z-[2]">
      <div>
        <h1 className="text-base text-center font-bold">ЛИЦЕНЗИОННЫЙ ДОГОВОР - ОФЕРТА</h1>
        <div>
          <p className="my-2 text-justify">Настоящий документ является официальным публичным предложением (публичной офертой) индивидуального предпринимателя Калюжина Антона Андреевича, ИНН: 614208087924 юридическому (в том числе и иностранному юридическому лицу) или физическому лицу (в том числе и иностранному гражданину или лицу без гражданства), заключить лицензионный договор (ст. 1235 Гражданского кодекса Российской Федерации, далее по тексту – «ГК РФ»), на условиях, изложенных в настоящей оферте.</p>
          <p className="my-2 text-justify">В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской Федерации (ГК РФ), в случае принятия изложенных ниже условий и оплаты лицензионного вознаграждения Лицензиара юридическое или физическое лицо (указанные выше) осуществившее акцепт настоящей оферты, становится Лицензиатом (в соответствии со ст. 438 ГК РФ, ст. 1235 ГК РФ). Акцепт настоящей оферты равносилен заключению договора на условиях, изложенных в ней.</p>
          <p className="text-center my-2">Акцептом настоящей оферты является оплата лицензионного вознаграждения Лицензиара.</p>
        </div>
        <div className="mt-8">
          <div className="mb-6">
            <h2 className="text-center font-bold text-base">1. ПРЕДМЕТ ДОГОВОРА</h2>
            <p className="my-2 text-justify">1.1. Лицензиар предоставляет Лицензиату на условиях простой (неисключительной) лицензии:</p>
            <p className="my-2 text-justify">
            - право использования музыкального произведения без текста (далее - Произведение), выбранное
            Лицензиатом посредством функциональных возможностей веб – ресурса, расположенного в сети
            «Интернет» по веб – адресу: <a href={"https://t.me/layer_store_bot"} className="text-[#7CC0AB]" target="_blank">https://t.me/layer_store_bot</a> (далее по тексту – «Приложение»),
            </p>
            <p className="my-2 text-justify">- право использования Приложения,</p>
            <p className="my-2 text-justify">
            в обусловленных настоящим Договором пределах и на определенный Договором срок, а Лицензиат за
            предоставление этих прав уплачивает вознаграждение Лицензиару в соответствии с условиями настоящего
            Договора.
            </p>
            <p className="my-2 text-justify">
            1.2. Лицензиар гарантирует наличие у него предоставляемых по настоящему Договору прав на
            Произведение и Приложение.
            </p>
            <p className="my-2 text-justify">
            1.3. По настоящему Договору Лицензиар предоставляет Лицензиату право использования Произведения и
            Приложения следующими способами:
            </p>
            <p className="my-2 text-justify">
            1.3.1. Использовать Произведение для создания иных аудио произведений в том числе за счет переработки/
            изменения Произведения.
            </p>
            <p className="my-2 text-justify">
            1.3.2. Сообщать Произведение в эфир и по кабелю, в том числе путем ретрансляции, воспроизводить в сети
            «Интернет».
            </p>
            <p className="my-2 text-justify">
            1.3.3. Осуществлять публичное исполнение Произведения в магазинах, парках и иных общественных
            местах.
            </p>
            <p className="my-2 text-justify">1.3.4. Использовать Приложение в пределах его функциональных возможностей.</p>
            <p className="my-2 text-justify">1.4. Лицензиат вправе использовать Произведение и Приложение на территории всего мира.</p>
            <p className="my-2 text-justify">1.5. Срок, на который Лицензиату передаются права на использование Произведения и Приложения по
              настоящему Договору составляет срок, который приравнивается к сроку оплаченной Лицензиатом подписки
              (лицензионного вознаграждения Лицензиара).
            </p>
            <p className="my-2 text-justify">
              1.6. Предоставление Лицензиату права использования Произведения и Приложения по настоящему Договору
              осуществляется с сохранением за Лицензиаром права выдачи лицензий другим лицам (неисключительная
              лицензия).
            </p>
            <p className="my-2 text-justify">
              1.7. Передача Произведения для его дальнейшего использования производится посредством
              функциональных возможностей Приложения. Доступ к использования Приложения осуществляется
              посредством сети «Интернет». Лицензиат несет расходы за доступ к сети «Интернет» самостоятельно.
            </p>
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">2. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
            <p className="my-2 text-justify">
              2.1. Права и обязанности Лицензиара:</p>
            <p className="my-2 text-justify">
              2.1.1. Лицензиар имеет право на своевременное получение вознаграждения в порядке и размере,
              установленных настоящим Договором.
            </p>
            <p className="my-2 text-justify">
              2.1.2. Лицензиар обязан воздерживаться от каких-либо действий, способных затруднить осуществление
              Лицензиатом предоставленного ему права использования Произведения и Приложения.
            </p>
            <p className="my-2 text-justify">
              2.2. Права и обязанности Лицензиата:
            </p>
            <p className="my-2 text-justify">
              2.2.1. Лицензиат вправе использовать Произведение и Приложение в порядке и на условиях, установленных
              настоящим Договором.
            </p>
            <p className="my-2 text-justify">
              2.2.2. Лицензиат обязан выплачивать Лицензиару вознаграждение в порядке и в размере, указанном в п. 3.2.
              настоящего Договора.
            </p>
            <p className="my-2 text-justify">
              2.2.3. Лицензиат не имеет права передавать или каким-либо иным образом отчуждать полученное по
              настоящему договору право использования Произведения и Приложения.
            </p>
            <p className="my-2 text-justify">
              2.3. Лицензиат не вправе использовать Произведение без указания имени Автора Произведения.
            </p>            
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">3. ВОЗНАГРАЖДЕНИЕ И ПОРЯДОК ЕГО ВЫПЛАТЫ</h2>
            <p className="my-2 text-justify">
              3.1. Лицензиат обязан выплачивать Лицензиару вознаграждение за использование Произведения и
              Приложения по настоящему Договору.
            </p>
            <p className="my-2 text-justify">
              3.2. Размер вознаграждения за использование Произведения и Приложения отображается в
              соответствующем графическом изображении в Приложении.
            </p>
            <p className="my-2 text-justify">
              3.3. Лицензионное вознаграждение Лицензиара подлежит оплате авансовым методом посредством
              безналичного платежа, осуществляемого за счет услуг 3 (третьих) лиц – специализированных сервисов
              (например, но не ограничиваясь «ЮМани» и т.д.).
            </p>
            <p className="my-2 text-justify">
              3.4. Доступ к Приложению и к Произведению за счет функционала Приложения гарантируется только после
              оплаты лицензионного вознаграждения Лицензиара и при условии действия соответствующей подписки (ее
              продления) Лицензиатом.
            </p>
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">4. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
            <p className="my-2 text-justify">
              4.1. Стороны в случае неисполнения или ненадлежащего исполнения своих обязательств по настоящему
              Договору несут ответственность в соответствии с нормами действующего законодательства РФ.
            </p>
            <p className="my-2 text-justify">
              4.2. При существенном нарушении Лицензиатом обязанности выплатить Лицензиару в установленный
              настоящим Договором срок вознаграждение за предоставление права использования Произведения и
              Приложения, Лицензиар может в одностороннем порядке отказаться от настоящего Договора и потребовать
              возмещения убытков, причиненных его расторжением.
            </p>
            <p className="my-2 text-justify">
              4.3. Использование Произведения и Приложения способом, не предусмотренным настоящим Договором,
              либо по прекращении действия Договора, либо иным образом за пределами прав, предоставленных
              Лицензиату по настоящему Договору, влечет ответственность за нарушение исключительного права на
              Произведение и Приложение, установленную Гражданским кодексом Российской Федерации или другими
              законами.
            </p>
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">5. ФОРС-МАЖОР</h2>
            <p className="my-2 text-justify">
              5.1. Обстоятельства форс-мажорного характера (непредвиденные обстоятельства непреодолимой силы), за
              которые Стороны не являются ответственными (стихийные бедствия, забастовки, войны, принятие
              государственными органами законов и подзаконных актов, препятствующих исполнению Договора, и
              другое), освобождают Сторону, не выполнившую своих обязательств в связи с наступлением указанных
              обстоятельств, от ответственности за такое невыполнение на срок действия этих обстоятельств.
            </p>
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">6. РАЗРЕШЕНИЕ СПОРОВ</h2>
            <p className="my-2 text-justify">
              6.1. В случае возникновения спора заинтересованная сторона направляет претензию другой стороне в
              письменной форме, подписанную уполномоченным лицом. Претензия должна быть направлена с
              использованием средств связи, обеспечивающих фиксирование ее отправления (заказной почтой,
              телеграфом и т.д.) и получения, либо вручена другой стороне под расписку.
            </p>
            <p className="my-2 text-justify">
              6.2. К претензии должны быть приложены документы, обосновывающие предъявленные заинтересованной
              стороной требования (в случае их отсутствия у другой стороны), и документы, подтверждающие
              полномочия лица, подписавшего претензию. Указанные документы представляются в форме надлежащим
              образом заверенных копий. Претензия, направленная без документов, подтверждающих полномочия лица, ее
              подписавшего, считается непредъявленной и рассмотрению не подлежит.
            </p>
            <p className="my-2 text-justify">
              6.3. Сторона, которой направлена претензия, обязана рассмотреть полученную претензию и о результатах
              уведомить в письменной форме заинтересованную сторону в течение 30 (тридцати) рабочих дней со дня
              получения претензии.
            </p>
            <p className="my-2 text-justify">
              6.4. При неурегулировании разногласий в претензионном порядке, а также в случае неполучения ответа на
              претензию в течение срока, указанного в п. <b>6.3</b>. настоящего Договора, споры разрешаются в суде в порядке,
              установленном действующим законодательством Российской Федерации.
            </p>
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">7. СРОК ДЕЙСТВИЯ ДОГОВОРА</h2>
            <p className="my-2 text-justify">
              7.1. Настоящий Договор вступает в силу с момента его подписания Сторонами и действует до полного
              исполнения ими своих обязательств по нему.
            </p>
          </div>
          <div>
            <h2 className="text-center font-bold text-base">8. РАСТОРЖЕНИЕ ДОГОВОРА</h2>
            <p className="my-2 text-justify">
              8.1. Стороны вправе досрочно расторгнуть Договор по взаимному письменному соглашению.
            </p>
            <p className="my-2 text-justify">
              8.2. Настоящий Договор автоматически прекращает свое действие в случае неоплаты лицензионного
              вознаграждения (т.е. в случае непродления подписки).
            </p>
          </div>
          <div className="my-6">
            <h2 className="text-center font-bold text-base">9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ И ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>
            <p className="my-2 text-justify">
              Индивидуальный предприниматель Калюжин Антон Андреевич
            </p>
            <p className="my-2 text-justify">
              ИНН: 614208087924;
            </p>
            <p className="my-2 text-justify">
              Регистрирующий орган: Межрайонная Инспекция Федеральной Налоговой Службы № 26 по Ростовской
              обл., 344019, Ростов-На-Дону гор., Мясникова ул. Д 52/32;
            </p>
          </div>
        </div>
      </div>
    </div>
  )
}
